/*----------------------------------------------------------------------------*/
/**
* @file		DMT_Driver.c
* @brief	DMTモジュールに関するドライバ関数
* @date		25/05/31
* @details	
* @note		
*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*インクルードファイル*/
/*----------------------------------------------------------------------------*/
#include <xc.h>
#include "BoardSupportPackage.h"
#include "init_fix.h"
#include "typedef.h"
#include "dmt_user.h"
/*----------------------------------------------------------------------------*/
/*定数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*変数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*プロトタイプ宣言*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*
* @fn        vdg_DMT_Set_Register(void) 
* @brief     DMTレジスタを初期化します
* @param
* @return
* @detail
*/
/*----------------------------------------------------------------------------*/
void vdg_DMT_Set_Register(void)
{
#if ( PMD_DMTMD == PMD_MODULE_ENABLE )		
	/*-----------------------------------------------------------------------*/
	/* DMTCONレジスタ */
	/*-----------------------------------------------------------------------*/
		DMTCON = 
			( DMT_USER_DMTCON_ON << _DMTCON_ON_POSITION ) ;
		#ifdef DEF_BITNAME
			DMTCONbits.ON = DMT_USER_DMTCON_ON;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* DMTPRECLRレジスタ */
	/*-----------------------------------------------------------------------*/
		DMTPRECLR = 
			( DMT_USER_DMTPRECLR_STEP1 << _DMTPRECLR_STEP1_POSITION ) ;
		#ifdef DEF_BITNAME
			DMTPRECLRbits.STEP1 = DMT_USER_DMTPRECLR_STEP1;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* DMTCLRレジスタ */
	/*-----------------------------------------------------------------------*/
		DMTCLR = 
			( DMT_USER_DMTCLR_STEP2 << _DMTCLR_STEP2_POSITION ) ;
		#ifdef DEF_BITNAME
			DMTCLRbits.STEP2 = DMT_USER_DMTCLR_STEP2;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* DMTSTATレジスタ */
	/*-----------------------------------------------------------------------*/
		DMTSTAT = 
			( DMT_USER_DMTSTAT_WINOPN << _DMTSTAT_WINOPN_POSITION ) |
			( DMT_USER_DMTSTAT_EVENT << _DMTSTAT_EVENT_POSITION ) |
			( DMT_USER_DMTSTAT_BAD2 << _DMTSTAT_BAD2_POSITION ) |
			( DMT_USER_DMTSTAT_BAD1 << _DMTSTAT_BAD1_POSITION ) ;
		#ifdef DEF_BITNAME
			DMTSTATbits.WINOPN = DMT_USER_DMTSTAT_WINOPN;
			DMTSTATbits.EVENT = DMT_USER_DMTSTAT_EVENT;
			DMTSTATbits.BAD2 = DMT_USER_DMTSTAT_BAD2;
			DMTSTATbits.BAD1 = DMT_USER_DMTSTAT_BAD1;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* DMTCNTレジスタ */
	/*-----------------------------------------------------------------------*/
		DMTCNT = DMT_USER_DMTCNT;

		
	/*-----------------------------------------------------------------------*/
	/* PPCレジスタ */
	/*-----------------------------------------------------------------------*/
		PPC = 
			( DMT_USER_PPC_NMISTEP2 << _PPC_NMISTEP2_POSITION ) ;
		#ifdef DEF_BITNAME
			PPCbits.NMISTEP2 = PR_USER_PPC_NMISTEP2;
		#endif 
	
	/*-----------------------------------------------------------------------*/
	/* PSCNTレジスタ */
	/*-----------------------------------------------------------------------*/
		PSCNT = DMT_USER_PSCNT;
	/*-----------------------------------------------------------------------*/
	/* PSINTVレジスタ */
	/*-----------------------------------------------------------------------*/
		PSINTV = DMT_USER_PSINTV;
	/*-----------------------------------------------------------------------*/
	/* PPPCレジスタ */
	/*-----------------------------------------------------------------------*/
		PPPC = 
			( DMT_USER_PPPC_NMISTEP1 << _PPPC_NMISTEP1_POSITION ) ;
		#ifdef DEF_BITNAME
			PPPCbits.NMISTEP1 = OTHER_USER_PPPC_NMISTEP1;
		#endif 
#endif
}
