
#ifndef I2C_USER_H
#define	I2C_USER_H

/*----------------------------------------------------------------------------*/
/*インクルードファイル*/
/*----------------------------------------------------------------------------*/
#include "i2c_driver.h"
/*----------------------------------------------------------------------------*/
/*定数定義*/
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* I2C1CON1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1CON1	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1CON1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1CON1_SEN	( 0U )
#define I2C_USER_I2C1CON1_RSEN	( 0U )
#define I2C_USER_I2C1CON1_PEN	( 0U )
#define I2C_USER_I2C1CON1_RCEN	( 0U )
#define I2C_USER_I2C1CON1_ACKEN	( 0U )
#define I2C_USER_I2C1CON1_ACKDT	( 0U )
#define I2C_USER_I2C1CON1_STREN	( 0U )
#define I2C_USER_I2C1CON1_GCEN	( 0U )
#define I2C_USER_I2C1CON1_DISSLW	( 0U )
#define I2C_USER_I2C1CON1_A10M	( 0U )
#define I2C_USER_I2C1CON1_STRICT	( 0U )
#define I2C_USER_I2C1CON1_SCLREL	( 0U )
#define I2C_USER_I2C1CON1_SIDL	( 0U )
#define I2C_USER_I2C1CON1_ON	( 0U )
#define I2C_USER_I2C1CON1_DHEN	( 0U )
#define I2C_USER_I2C1CON1_AHEN	( 0U )
#define I2C_USER_I2C1CON1_SBCDE	( 0U )
#define I2C_USER_I2C1CON1_SDAHT	( 0U )
#define I2C_USER_I2C1CON1_BOEN	( 0U )
#define I2C_USER_I2C1CON1_SCIE	( 0U )
#define I2C_USER_I2C1CON1_PCIE	( 0U )
#define I2C_USER_I2C1CON1_SMBEN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1STAT1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1STAT1	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1STAT1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1STAT1_TBF	( 0U )
#define I2C_USER_I2C1STAT1_RBF	( 0U )
#define I2C_USER_I2C1STAT1_R_W	( 0U )
#define I2C_USER_I2C1STAT1_S	( 0U )
#define I2C_USER_I2C1STAT1_P	( 0U )
#define I2C_USER_I2C1STAT1_D_A	( 0U )
#define I2C_USER_I2C1STAT1_I2COV	( 0U )
#define I2C_USER_I2C1STAT1_IWCOL	( 0U )
#define I2C_USER_I2C1STAT1_ADD10	( 0U )
#define I2C_USER_I2C1STAT1_GCSTAT	( 0U )
#define I2C_USER_I2C1STAT1_BCL	( 0U )
#define I2C_USER_I2C1STAT1_ACKTIM	( 0U )
#define I2C_USER_I2C1STAT1_TRSTAT	( 0U )
#define I2C_USER_I2C1STAT1_ACKSTAT	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1ADDレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1ADD	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1ADDレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1ADD_I2CADD	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1MSKレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1MSK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1MSKレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1MSK_I2CMSK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1HBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1HBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1HBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1HBRG_I2CHBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1TRNレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1TRN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1TRNレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1TRN_I2CTRN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1RCVレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1RCV	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1RCVレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1RCV_I2CRCV	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1CON2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1CON2	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1CON2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1CON2_PSZ	( 0U )
#define I2C_USER_I2C1CON2_BITE	( 0U )
#define I2C_USER_I2C1CON2_SMEN	( 0U )
#define I2C_USER_I2C1CON2_NDA	( 0U )
#define I2C_USER_I2C1CON2_EOPSC	( 0U )
#define I2C_USER_I2C1CON2_HNACKIGN	( 0U )
#define I2C_USER_I2C1CON2_ACKC	( 0U )
#define I2C_USER_I2C1CON2_EPSZE	( 0U )
#define I2C_USER_I2C1CON2_CBCTE	( 0U )
#define I2C_USER_I2C1CON2_HBCTE	( 0U )
#define I2C_USER_I2C1CON2_BSCLTE	( 0U )
#define I2C_USER_I2C1CON2_PECC	( 0U )
#define I2C_USER_I2C1CON2_AMODE	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1LBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1LBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1LBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1LBRG_I2CLBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1INTCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1INTC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1INTCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1INTC_HDRXIE	( 0U )
#define I2C_USER_I2C1INTC_HDTXIE	( 0U )
#define I2C_USER_I2C1INTC_CDTXIE	( 0U )
#define I2C_USER_I2C1INTC_CDRXIE	( 0U )
#define I2C_USER_I2C1INTC_TXIE	( 0U )
#define I2C_USER_I2C1INTC_RXIE	( 0U )
#define I2C_USER_I2C1INTC_CADDRIE	( 0U )
#define I2C_USER_I2C1INTC_HACKSIE	( 0U )
#define I2C_USER_I2C1INTC_CLTIE	( 0U )
#define I2C_USER_I2C1INTC_HSTIE	( 0U )
#define I2C_USER_I2C1INTC_HSBCLIE	( 0U )
#define I2C_USER_I2C1INTC_BCLIE	( 0U )
#define I2C_USER_I2C1INTC_CRCIE	( 0U )
#define I2C_USER_I2C1INTC_NACKIE	( 0U )
#define I2C_USER_I2C1INTC_FRMEIE	( 0U )
#define I2C_USER_I2C1INTC_BITIE	( 0U )
#define I2C_USER_I2C1INTC_CBCTIE	( 0U )
#define I2C_USER_I2C1INTC_HBCTIE	( 0U )
#define I2C_USER_I2C1INTC_BSCLTIE	( 0U )
#define I2C_USER_I2C1INTC_EOPIE	( 0U )
#define I2C_USER_I2C1INTC_HBCLIE	( 0U )
#define I2C_USER_I2C1INTC_HSCIE	( 0U )
#define I2C_USER_I2C1INTC_HPCIE	( 0U )
#define I2C_USER_I2C1INTC_CBCLIE	( 0U )
#define I2C_USER_I2C1INTC_I2CEIE	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1STAT2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1STAT2	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1STAT2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1STAT2_SCLCNT	( 0U )
#define I2C_USER_I2C1STAT2_ERR	( 0U )
#define I2C_USER_I2C1STAT2_CLTIF	( 0U )
#define I2C_USER_I2C1STAT2_HSTIF	( 0U )
#define I2C_USER_I2C1STAT2_STARTE	( 0U )
#define I2C_USER_I2C1STAT2_STOPE	( 0U )
#define I2C_USER_I2C1STAT2_CRCE	( 0U )
#define I2C_USER_I2C1STAT2_NACKE	( 0U )
#define I2C_USER_I2C1STAT2_FRME	( 0U )
#define I2C_USER_I2C1STAT2_BITO	( 0U )
#define I2C_USER_I2C1STAT2_CBCLTO	( 0U )
#define I2C_USER_I2C1STAT2_HBCLTO	( 0U )
#define I2C_USER_I2C1STAT2_BSCLTO	( 0U )
#define I2C_USER_I2C1STAT2_EOP	( 0U )
#define I2C_USER_I2C1STAT2_HSBCL	( 0U )
#define I2C_USER_I2C1STAT2_HSTACT	( 0U )
#define I2C_USER_I2C1STAT2_CLTACT	( 0U )
#define I2C_USER_I2C1STAT2_SSPND	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1PECレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1PEC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1PECレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1PEC_RCRC	( 0U )
#define I2C_USER_I2C1PEC_CCRC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1BTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1BTO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1BTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1BTO_BTOPR	( 0U )
#define I2C_USER_I2C1BTO_BTOCLK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1HBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1HBCTO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1HBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1HBCTO_HBCTOTMR	( 0U )
#define I2C_USER_I2C1HBCTO_HBCTOCLK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1CBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1CBCTO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1CBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1CBCTO_CBCTOTMR	( 0U )
#define I2C_USER_I2C1CBCTO_CBCTOCLK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1BITOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1BITO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1BITOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1BITO_BITOTMR	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1SDASUTレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1SDASUT	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1SDASUTレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1SDASUT_SDASUT	( 0U )
#define I2C_USER_I2C1SDASUT_SDASUTEN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1HDLYCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1HDLYC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C1HDLYCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C1HDLYC_HIDLYC	( 0U )
#define I2C_USER_I2C1HDLYC_HIDLYCEN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2CON1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2CON1	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2CON1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2CON1_SEN	( 0U )
#define I2C_USER_I2C2CON1_RSEN	( 0U )
#define I2C_USER_I2C2CON1_PEN	( 0U )
#define I2C_USER_I2C2CON1_RCEN	( 0U )
#define I2C_USER_I2C2CON1_ACKEN	( 0U )
#define I2C_USER_I2C2CON1_ACKDT	( 0U )
#define I2C_USER_I2C2CON1_STREN	( 0U )
#define I2C_USER_I2C2CON1_GCEN	( 0U )
#define I2C_USER_I2C2CON1_DISSLW	( 0U )
#define I2C_USER_I2C2CON1_A10M	( 0U )
#define I2C_USER_I2C2CON1_STRICT	( 0U )
#define I2C_USER_I2C2CON1_SCLREL	( 0U )
#define I2C_USER_I2C2CON1_SIDL	( 0U )
#define I2C_USER_I2C2CON1_ON	( 0U )
#define I2C_USER_I2C2CON1_DHEN	( 0U )
#define I2C_USER_I2C2CON1_AHEN	( 0U )
#define I2C_USER_I2C2CON1_SBCDE	( 0U )
#define I2C_USER_I2C2CON1_SDAHT	( 0U )
#define I2C_USER_I2C2CON1_BOEN	( 0U )
#define I2C_USER_I2C2CON1_SCIE	( 0U )
#define I2C_USER_I2C2CON1_PCIE	( 0U )
#define I2C_USER_I2C2CON1_SMBEN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2STAT1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2STAT1	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2STAT1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2STAT1_TBF	( 0U )
#define I2C_USER_I2C2STAT1_RBF	( 0U )
#define I2C_USER_I2C2STAT1_R_W	( 0U )
#define I2C_USER_I2C2STAT1_S	( 0U )
#define I2C_USER_I2C2STAT1_P	( 0U )
#define I2C_USER_I2C2STAT1_D_A	( 0U )
#define I2C_USER_I2C2STAT1_I2COV	( 0U )
#define I2C_USER_I2C2STAT1_IWCOL	( 0U )
#define I2C_USER_I2C2STAT1_ADD10	( 0U )
#define I2C_USER_I2C2STAT1_GCSTAT	( 0U )
#define I2C_USER_I2C2STAT1_BCL	( 0U )
#define I2C_USER_I2C2STAT1_ACKTIM	( 0U )
#define I2C_USER_I2C2STAT1_TRSTAT	( 0U )
#define I2C_USER_I2C2STAT1_ACKSTAT	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2ADDレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2ADD	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2ADDレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2ADD_I2CADD	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2MSKレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2MSK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2MSKレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2MSK_I2CMSK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2HBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2HBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2HBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2HBRG_I2CHBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2TRNレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2TRN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2TRNレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2TRN_I2CTRN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2RCVレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2RCV	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2RCVレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2RCV_I2CRCV	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2CON2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2CON2	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2CON2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2CON2_PSZ	( 0U )
#define I2C_USER_I2C2CON2_BITE	( 0U )
#define I2C_USER_I2C2CON2_SMEN	( 0U )
#define I2C_USER_I2C2CON2_NDA	( 0U )
#define I2C_USER_I2C2CON2_EOPSC	( 0U )
#define I2C_USER_I2C2CON2_HNACKIGN	( 0U )
#define I2C_USER_I2C2CON2_ACKC	( 0U )
#define I2C_USER_I2C2CON2_EPSZE	( 0U )
#define I2C_USER_I2C2CON2_CBCTE	( 0U )
#define I2C_USER_I2C2CON2_HBCTE	( 0U )
#define I2C_USER_I2C2CON2_BSCLTE	( 0U )
#define I2C_USER_I2C2CON2_PECC	( 0U )
#define I2C_USER_I2C2CON2_AMODE	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2LBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2LBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2LBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2LBRG_I2CLBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2INTCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2INTC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2INTCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2INTC_HDRXIE	( 0U )
#define I2C_USER_I2C2INTC_HDTXIE	( 0U )
#define I2C_USER_I2C2INTC_CDTXIE	( 0U )
#define I2C_USER_I2C2INTC_CDRXIE	( 0U )
#define I2C_USER_I2C2INTC_TXIE	( 0U )
#define I2C_USER_I2C2INTC_RXIE	( 0U )
#define I2C_USER_I2C2INTC_CADDRIE	( 0U )
#define I2C_USER_I2C2INTC_HACKSIE	( 0U )
#define I2C_USER_I2C2INTC_CLTIE	( 0U )
#define I2C_USER_I2C2INTC_HSTIE	( 0U )
#define I2C_USER_I2C2INTC_HSBCLIE	( 0U )
#define I2C_USER_I2C2INTC_BCLIE	( 0U )
#define I2C_USER_I2C2INTC_CRCIE	( 0U )
#define I2C_USER_I2C2INTC_NACKIE	( 0U )
#define I2C_USER_I2C2INTC_FRMEIE	( 0U )
#define I2C_USER_I2C2INTC_BITIE	( 0U )
#define I2C_USER_I2C2INTC_CBCTIE	( 0U )
#define I2C_USER_I2C2INTC_HBCTIE	( 0U )
#define I2C_USER_I2C2INTC_BSCLTIE	( 0U )
#define I2C_USER_I2C2INTC_EOPIE	( 0U )
#define I2C_USER_I2C2INTC_HBCLIE	( 0U )
#define I2C_USER_I2C2INTC_HSCIE	( 0U )
#define I2C_USER_I2C2INTC_HPCIE	( 0U )
#define I2C_USER_I2C2INTC_CBCLIE	( 0U )
#define I2C_USER_I2C2INTC_I2CEIE	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2STAT2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2STAT2	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2STAT2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2STAT2_SCLCNT	( 0U )
#define I2C_USER_I2C2STAT2_ERR	( 0U )
#define I2C_USER_I2C2STAT2_CLTIF	( 0U )
#define I2C_USER_I2C2STAT2_HSTIF	( 0U )
#define I2C_USER_I2C2STAT2_STARTE	( 0U )
#define I2C_USER_I2C2STAT2_STOPE	( 0U )
#define I2C_USER_I2C2STAT2_CRCE	( 0U )
#define I2C_USER_I2C2STAT2_NACKE	( 0U )
#define I2C_USER_I2C2STAT2_FRME	( 0U )
#define I2C_USER_I2C2STAT2_BITO	( 0U )
#define I2C_USER_I2C2STAT2_CBCLTO	( 0U )
#define I2C_USER_I2C2STAT2_HBCLTO	( 0U )
#define I2C_USER_I2C2STAT2_BSCLTO	( 0U )
#define I2C_USER_I2C2STAT2_EOP	( 0U )
#define I2C_USER_I2C2STAT2_HSBCL	( 0U )
#define I2C_USER_I2C2STAT2_HSTACT	( 0U )
#define I2C_USER_I2C2STAT2_CLTACT	( 0U )
#define I2C_USER_I2C2STAT2_SSPND	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2PECレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2PEC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2PECレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2PEC_RCRC	( 0U )
#define I2C_USER_I2C2PEC_CCRC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2BTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2BTO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2BTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2BTO_BTOPR	( 0U )
#define I2C_USER_I2C2BTO_BTOCLK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2HBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2HBCTO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2HBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2HBCTO_HBCTOTMR	( 0U )
#define I2C_USER_I2C2HBCTO_HBCTOCLK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2CBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2CBCTO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2CBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2CBCTO_CBCTOTMR	( 0U )
#define I2C_USER_I2C2CBCTO_CBCTOCLK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2BITOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2BITO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2BITOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2BITO_BITOTMR	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2SDASUTレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2SDASUT	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2SDASUTレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2SDASUT_SDASUT	( 0U )
#define I2C_USER_I2C2SDASUT_SDASUTEN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2HDLYCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2HDLYC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C2HDLYCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C2HDLYC_HIDLYC	( 0U )
#define I2C_USER_I2C2HDLYC_HIDLYCEN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3CON1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3CON1	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3CON1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3CON1_SEN	( 0U )
#define I2C_USER_I2C3CON1_RSEN	( 0U )
#define I2C_USER_I2C3CON1_PEN	( 0U )
#define I2C_USER_I2C3CON1_RCEN	( 0U )
#define I2C_USER_I2C3CON1_ACKEN	( 0U )
#define I2C_USER_I2C3CON1_ACKDT	( 0U )
#define I2C_USER_I2C3CON1_STREN	( 0U )
#define I2C_USER_I2C3CON1_GCEN	( 0U )
#define I2C_USER_I2C3CON1_DISSLW	( 0U )
#define I2C_USER_I2C3CON1_A10M	( 0U )
#define I2C_USER_I2C3CON1_STRICT	( 0U )
#define I2C_USER_I2C3CON1_SCLREL	( 0U )
#define I2C_USER_I2C3CON1_SIDL	( 0U )
#define I2C_USER_I2C3CON1_ON	( 0U )
#define I2C_USER_I2C3CON1_DHEN	( 0U )
#define I2C_USER_I2C3CON1_AHEN	( 0U )
#define I2C_USER_I2C3CON1_SBCDE	( 0U )
#define I2C_USER_I2C3CON1_SDAHT	( 0U )
#define I2C_USER_I2C3CON1_BOEN	( 0U )
#define I2C_USER_I2C3CON1_SCIE	( 0U )
#define I2C_USER_I2C3CON1_PCIE	( 0U )
#define I2C_USER_I2C3CON1_SMBEN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3STAT1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3STAT1	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3STAT1レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3STAT1_TBF	( 0U )
#define I2C_USER_I2C3STAT1_RBF	( 0U )
#define I2C_USER_I2C3STAT1_R_W	( 0U )
#define I2C_USER_I2C3STAT1_S	( 0U )
#define I2C_USER_I2C3STAT1_P	( 0U )
#define I2C_USER_I2C3STAT1_D_A	( 0U )
#define I2C_USER_I2C3STAT1_I2COV	( 0U )
#define I2C_USER_I2C3STAT1_IWCOL	( 0U )
#define I2C_USER_I2C3STAT1_ADD10	( 0U )
#define I2C_USER_I2C3STAT1_GCSTAT	( 0U )
#define I2C_USER_I2C3STAT1_BCL	( 0U )
#define I2C_USER_I2C3STAT1_ACKTIM	( 0U )
#define I2C_USER_I2C3STAT1_TRSTAT	( 0U )
#define I2C_USER_I2C3STAT1_ACKSTAT	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3ADDレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3ADD	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3ADDレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3ADD_I2CADD	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3MSKレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3MSK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3MSKレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3MSK_I2CMSK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3HBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3HBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3HBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3HBRG_I2CHBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3TRNレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3TRN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3TRNレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3TRN_I2CTRN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3RCVレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3RCV	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3RCVレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3RCV_I2CRCV	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3CON2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3CON2	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3CON2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3CON2_PSZ	( 0U )
#define I2C_USER_I2C3CON2_BITE	( 0U )
#define I2C_USER_I2C3CON2_SMEN	( 0U )
#define I2C_USER_I2C3CON2_NDA	( 0U )
#define I2C_USER_I2C3CON2_EOPSC	( 0U )
#define I2C_USER_I2C3CON2_HNACKIGN	( 0U )
#define I2C_USER_I2C3CON2_ACKC	( 0U )
#define I2C_USER_I2C3CON2_EPSZE	( 0U )
#define I2C_USER_I2C3CON2_CBCTE	( 0U )
#define I2C_USER_I2C3CON2_HBCTE	( 0U )
#define I2C_USER_I2C3CON2_BSCLTE	( 0U )
#define I2C_USER_I2C3CON2_PECC	( 0U )
#define I2C_USER_I2C3CON2_AMODE	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3LBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3LBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3LBRGレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3LBRG_I2CLBRG	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3INTCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3INTC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3INTCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3INTC_HDRXIE	( 0U )
#define I2C_USER_I2C3INTC_HDTXIE	( 0U )
#define I2C_USER_I2C3INTC_CDTXIE	( 0U )
#define I2C_USER_I2C3INTC_CDRXIE	( 0U )
#define I2C_USER_I2C3INTC_TXIE	( 0U )
#define I2C_USER_I2C3INTC_RXIE	( 0U )
#define I2C_USER_I2C3INTC_CADDRIE	( 0U )
#define I2C_USER_I2C3INTC_HACKSIE	( 0U )
#define I2C_USER_I2C3INTC_CLTIE	( 0U )
#define I2C_USER_I2C3INTC_HSTIE	( 0U )
#define I2C_USER_I2C3INTC_HSBCLIE	( 0U )
#define I2C_USER_I2C3INTC_BCLIE	( 0U )
#define I2C_USER_I2C3INTC_CRCIE	( 0U )
#define I2C_USER_I2C3INTC_NACKIE	( 0U )
#define I2C_USER_I2C3INTC_FRMEIE	( 0U )
#define I2C_USER_I2C3INTC_BITIE	( 0U )
#define I2C_USER_I2C3INTC_CBCTIE	( 0U )
#define I2C_USER_I2C3INTC_HBCTIE	( 0U )
#define I2C_USER_I2C3INTC_BSCLTIE	( 0U )
#define I2C_USER_I2C3INTC_EOPIE	( 0U )
#define I2C_USER_I2C3INTC_HBCLIE	( 0U )
#define I2C_USER_I2C3INTC_HSCIE	( 0U )
#define I2C_USER_I2C3INTC_HPCIE	( 0U )
#define I2C_USER_I2C3INTC_CBCLIE	( 0U )
#define I2C_USER_I2C3INTC_I2CEIE	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3STAT2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3STAT2	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3STAT2レジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3STAT2_SCLCNT	( 0U )
#define I2C_USER_I2C3STAT2_ERR	( 0U )
#define I2C_USER_I2C3STAT2_CLTIF	( 0U )
#define I2C_USER_I2C3STAT2_HSTIF	( 0U )
#define I2C_USER_I2C3STAT2_STARTE	( 0U )
#define I2C_USER_I2C3STAT2_STOPE	( 0U )
#define I2C_USER_I2C3STAT2_CRCE	( 0U )
#define I2C_USER_I2C3STAT2_NACKE	( 0U )
#define I2C_USER_I2C3STAT2_FRME	( 0U )
#define I2C_USER_I2C3STAT2_BITO	( 0U )
#define I2C_USER_I2C3STAT2_CBCLTO	( 0U )
#define I2C_USER_I2C3STAT2_HBCLTO	( 0U )
#define I2C_USER_I2C3STAT2_BSCLTO	( 0U )
#define I2C_USER_I2C3STAT2_EOP	( 0U )
#define I2C_USER_I2C3STAT2_HSBCL	( 0U )
#define I2C_USER_I2C3STAT2_HSTACT	( 0U )
#define I2C_USER_I2C3STAT2_CLTACT	( 0U )
#define I2C_USER_I2C3STAT2_SSPND	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3PECレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3PEC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3PECレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3PEC_RCRC	( 0U )
#define I2C_USER_I2C3PEC_CCRC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3BTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3BTO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3BTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3BTO_BTOPR	( 0U )
#define I2C_USER_I2C3BTO_BTOCLK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3HBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3HBCTO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3HBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3HBCTO_HBCTOTMR	( 0U )
#define I2C_USER_I2C3HBCTO_HBCTOCLK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3CBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3CBCTO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3CBCTOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3CBCTO_CBCTOTMR	( 0U )
#define I2C_USER_I2C3CBCTO_CBCTOCLK	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3BITOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3BITO	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3BITOレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3BITO_BITOTMR	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3SDASUTレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3SDASUT	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3SDASUTレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3SDASUT_SDASUT	( 0U )
#define I2C_USER_I2C3SDASUT_SDASUTEN	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3HDLYCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3HDLYC	( 0U )
/*----------------------------------------------------------------------------*/
/* I2C3HDLYCレジスタ */
/*----------------------------------------------------------------------------*/
#define I2C_USER_I2C3HDLYC_HIDLYC	( 0U )
#define I2C_USER_I2C3HDLYC_HIDLYCEN	( 0U )

/*----------------------------------------------------------------------------*/
/*変数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*プロトタイプ宣言*/
/*----------------------------------------------------------------------------*/

#endif	/* I2C_USER_H */

