/*----------------------------------------------------------------------------*/
/*【FILE】その他のレジスタに関するドライバ関数*/
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/*インクルードファイル*/
/*----------------------------------------------------------------------------*/
#include <xc.h>
#include "BoardSupportPackage.h"
#include "init_fix.h"
#include "typedef.h"
#include "other_user.h"
/*----------------------------------------------------------------------------*/
/*定数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*変数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*プロトタイプ宣言*/
/*----------------------------------------------------------------------------*/
void vdg_Other_Set_Register(void)
{
	/*-----------------------------------------------------------------------*/
	/* PPCレジスタ */
	/*-----------------------------------------------------------------------*/
		PPC = 
			( OTHER_USER_PPC_NMISTEP2 << _PPC_NMISTEP2_POSITION ) ;
		#ifdef DEF_BITNAME
			PPCbits.NMISTEP2 = PR_USER_PPC_NMISTEP2;
		#endif 
	
	/*-----------------------------------------------------------------------*/
	/* PSCNTレジスタ */
	/*-----------------------------------------------------------------------*/
		PSCNT = OTHER_USER_PSCNT;
	/*-----------------------------------------------------------------------*/
	/* PSINTVレジスタ */
	/*-----------------------------------------------------------------------*/
		PSINTV = OTHER_USER_PSINTV;
	/*-----------------------------------------------------------------------*/
	/* PPPCレジスタ */
	/*-----------------------------------------------------------------------*/
		PPPC = 
			( OTHER_USER_PPPC_NMISTEP1 << _PPPC_NMISTEP1_POSITION ) ;
		#ifdef DEF_BITNAME
			PPPCbits.NMISTEP1 = OTHER_USER_PPPC_NMISTEP1;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* UREFCONレジスタ */
	/*-----------------------------------------------------------------------*/
		UREFCON = 
			( OTHER_USER_UREFCON_OUTSEL << _UREFCON_OUTSEL_POSITION ) |
			( OTHER_USER_UREFCON_INSEL << _UREFCON_INSEL_POSITION ) |
			( OTHER_USER_UREFCON_ON << _UREFCON_ON_POSITION ) ;
		#ifdef DEF_BITNAME
			UREFCONbits.OUTSEL = OTHER_USER_UREFCON_OUTSEL;
			UREFCONbits.INSEL = OTHER_USER_UREFCON_INSEL;
			UREFCONbits.ON = OTHER_USER_UREFCON_ON;
		#endif 

	/*-----------------------------------------------------------------------*/
	/* CAMCONレジスタ */
	/*-----------------------------------------------------------------------*/
		CAMCON = 
			( OTHER_USER_CAMCON_SIDL << _CAMCON_SIDL_POSITION ) |
			( OTHER_USER_CAMCON_ON << _CAMCON_ON_POSITION ) ;
		#ifdef DEF_BITNAME
			CAMCONbits.SIDL = OTHER_USER_CAMCON_SIDL;
			CAMCONbits.ON = OTHER_USER_CAMCON_ON;
		#endif 	

}