
#ifndef QEI_USER_H
#define	QEI_USER_H

/*----------------------------------------------------------------------------*/
/*インクルードファイル*/
/*----------------------------------------------------------------------------*/
#include "qei_driver.h"
/*----------------------------------------------------------------------------*/
/*定数定義*/
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* QEI1CONレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI1CON	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI1CONレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI1CON_CCM	( 0U )
#define QEI_USER_QEI1CON_GATEN	( 0U )
#define QEI_USER_QEI1CON_CNTPOL	( 0U )
#define QEI_USER_QEI1CON_INTDIV	( 0U )
#define QEI_USER_QEI1CON_IMV	( 0U )
#define QEI_USER_QEI1CON_PIMOD	( 0U )
#define QEI_USER_QEI1CON_SIDL	( 0U )
#define QEI_USER_QEI1CON_ON	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI1IOCレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI1IOC	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI1IOCレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI1IOC_QEA	( 0U )
#define QEI_USER_QEI1IOC_QEB	( 0U )
#define QEI_USER_QEI1IOC_INDEX	( 0U )
#define QEI_USER_QEI1IOC_HOME	( 0U )
#define QEI_USER_QEI1IOC_QEAPOL	( 0U )
#define QEI_USER_QEI1IOC_QEBPOL	( 0U )
#define QEI_USER_QEI1IOC_IDXPOL	( 0U )
#define QEI_USER_QEI1IOC_HOMPOL	( 0U )
#define QEI_USER_QEI1IOC_SWPAB	( 0U )
#define QEI_USER_QEI1IOC_OUTFNC	( 0U )
#define QEI_USER_QEI1IOC_QFDIV	( 0U )
#define QEI_USER_QEI1IOC_FLTREN	( 0U )
#define QEI_USER_QEI1IOC_QCAPEN	( 0U )
#define QEI_USER_QEI1IOC_HCAPEN	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI1STATレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI1STAT	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI1STATレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI1STAT_IDXIEN	( 0U )
#define QEI_USER_QEI1STAT_IDXIRQ	( 0U )
#define QEI_USER_QEI1STAT_HOMIEN	( 0U )
#define QEI_USER_QEI1STAT_HOMIRQ	( 0U )
#define QEI_USER_QEI1STAT_VELOVIEN	( 0U )
#define QEI_USER_QEI1STAT_VELOVIRQ	( 0U )
#define QEI_USER_QEI1STAT_PCIIEN	( 0U )
#define QEI_USER_QEI1STAT_PCIIRQ	( 0U )
#define QEI_USER_QEI1STAT_POSOVIEN	( 0U )
#define QEI_USER_QEI1STAT_POSOVIRQ	( 0U )
#define QEI_USER_QEI1STAT_PCLEQIEN	( 0U )
#define QEI_USER_QEI1STAT_PCLEQIRQ	( 0U )
#define QEI_USER_QEI1STAT_PCHEQIEN	( 0U )
#define QEI_USER_QEI1STAT_PCHEQIRQ	( 0U )
/*----------------------------------------------------------------------------*/
/* POS1CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_POS1CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* POS1HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_POS1HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* VEL1CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_VEL1CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* VEL1HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_VEL1HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* INT1TMRレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INT1TMR	( 0U )
/*----------------------------------------------------------------------------*/
/* INT1HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INT1HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* INDX1CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INDX1CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* INDX1HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INDX1HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI1GECレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI1GEC	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI1LECレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI1LEC	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI2CONレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI2CON	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI2CONレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI2CON_CCM	( 0U )
#define QEI_USER_QEI2CON_GATEN	( 0U )
#define QEI_USER_QEI2CON_CNTPOL	( 0U )
#define QEI_USER_QEI2CON_INTDIV	( 0U )
#define QEI_USER_QEI2CON_IMV	( 0U )
#define QEI_USER_QEI2CON_PIMOD	( 0U )
#define QEI_USER_QEI2CON_SIDL	( 0U )
#define QEI_USER_QEI2CON_ON	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI2IOCレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI2IOC	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI2IOCレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI2IOC_QEA	( 0U )
#define QEI_USER_QEI2IOC_QEB	( 0U )
#define QEI_USER_QEI2IOC_INDEX	( 0U )
#define QEI_USER_QEI2IOC_HOME	( 0U )
#define QEI_USER_QEI2IOC_QEAPOL	( 0U )
#define QEI_USER_QEI2IOC_QEBPOL	( 0U )
#define QEI_USER_QEI2IOC_IDXPOL	( 0U )
#define QEI_USER_QEI2IOC_HOMPOL	( 0U )
#define QEI_USER_QEI2IOC_SWPAB	( 0U )
#define QEI_USER_QEI2IOC_OUTFNC	( 0U )
#define QEI_USER_QEI2IOC_QFDIV	( 0U )
#define QEI_USER_QEI2IOC_FLTREN	( 0U )
#define QEI_USER_QEI2IOC_QCAPEN	( 0U )
#define QEI_USER_QEI2IOC_HCAPEN	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI2STATレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI2STAT	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI2STATレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI2STAT_IDXIEN	( 0U )
#define QEI_USER_QEI2STAT_IDXIRQ	( 0U )
#define QEI_USER_QEI2STAT_HOMIEN	( 0U )
#define QEI_USER_QEI2STAT_HOMIRQ	( 0U )
#define QEI_USER_QEI2STAT_VELOVIEN	( 0U )
#define QEI_USER_QEI2STAT_VELOVIRQ	( 0U )
#define QEI_USER_QEI2STAT_PCIIEN	( 0U )
#define QEI_USER_QEI2STAT_PCIIRQ	( 0U )
#define QEI_USER_QEI2STAT_POSOVIEN	( 0U )
#define QEI_USER_QEI2STAT_POSOVIRQ	( 0U )
#define QEI_USER_QEI2STAT_PCLEQIEN	( 0U )
#define QEI_USER_QEI2STAT_PCLEQIRQ	( 0U )
#define QEI_USER_QEI2STAT_PCHEQIEN	( 0U )
#define QEI_USER_QEI2STAT_PCHEQIRQ	( 0U )
/*----------------------------------------------------------------------------*/
/* POS2CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_POS2CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* POS2HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_POS2HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* VEL2CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_VEL2CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* VEL2HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_VEL2HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* INT2TMRレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INT2TMR	( 0U )
/*----------------------------------------------------------------------------*/
/* INT2HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INT2HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* INDX2CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INDX2CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* INDX2HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INDX2HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI2GECレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI2GEC	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI2LECレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI2LEC	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI3CONレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI3CON	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI3CONレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI3CON_CCM	( 0U )
#define QEI_USER_QEI3CON_GATEN	( 0U )
#define QEI_USER_QEI3CON_CNTPOL	( 0U )
#define QEI_USER_QEI3CON_INTDIV	( 0U )
#define QEI_USER_QEI3CON_IMV	( 0U )
#define QEI_USER_QEI3CON_PIMOD	( 0U )
#define QEI_USER_QEI3CON_SIDL	( 0U )
#define QEI_USER_QEI3CON_ON	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI3IOCレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI3IOC	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI3IOCレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI3IOC_QEA	( 0U )
#define QEI_USER_QEI3IOC_QEB	( 0U )
#define QEI_USER_QEI3IOC_INDEX	( 0U )
#define QEI_USER_QEI3IOC_HOME	( 0U )
#define QEI_USER_QEI3IOC_QEAPOL	( 0U )
#define QEI_USER_QEI3IOC_QEBPOL	( 0U )
#define QEI_USER_QEI3IOC_IDXPOL	( 0U )
#define QEI_USER_QEI3IOC_HOMPOL	( 0U )
#define QEI_USER_QEI3IOC_SWPAB	( 0U )
#define QEI_USER_QEI3IOC_OUTFNC	( 0U )
#define QEI_USER_QEI3IOC_QFDIV	( 0U )
#define QEI_USER_QEI3IOC_FLTREN	( 0U )
#define QEI_USER_QEI3IOC_QCAPEN	( 0U )
#define QEI_USER_QEI3IOC_HCAPEN	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI3STATレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI3STAT	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI3STATレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI3STAT_IDXIEN	( 0U )
#define QEI_USER_QEI3STAT_IDXIRQ	( 0U )
#define QEI_USER_QEI3STAT_HOMIEN	( 0U )
#define QEI_USER_QEI3STAT_HOMIRQ	( 0U )
#define QEI_USER_QEI3STAT_VELOVIEN	( 0U )
#define QEI_USER_QEI3STAT_VELOVIRQ	( 0U )
#define QEI_USER_QEI3STAT_PCIIEN	( 0U )
#define QEI_USER_QEI3STAT_PCIIRQ	( 0U )
#define QEI_USER_QEI3STAT_POSOVIEN	( 0U )
#define QEI_USER_QEI3STAT_POSOVIRQ	( 0U )
#define QEI_USER_QEI3STAT_PCLEQIEN	( 0U )
#define QEI_USER_QEI3STAT_PCLEQIRQ	( 0U )
#define QEI_USER_QEI3STAT_PCHEQIEN	( 0U )
#define QEI_USER_QEI3STAT_PCHEQIRQ	( 0U )
/*----------------------------------------------------------------------------*/
/* POS3CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_POS3CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* POS3HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_POS3HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* VEL3CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_VEL3CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* VEL3HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_VEL3HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* INT3TMRレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INT3TMR	( 0U )
/*----------------------------------------------------------------------------*/
/* INT3HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INT3HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* INDX3CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INDX3CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* INDX3HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INDX3HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI3GECレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI3GEC	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI3LECレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI3LEC	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI4CONレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI4CON	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI4CONレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI4CON_CCM	( 0U )
#define QEI_USER_QEI4CON_GATEN	( 0U )
#define QEI_USER_QEI4CON_CNTPOL	( 0U )
#define QEI_USER_QEI4CON_INTDIV	( 0U )
#define QEI_USER_QEI4CON_IMV	( 0U )
#define QEI_USER_QEI4CON_PIMOD	( 0U )
#define QEI_USER_QEI4CON_SIDL	( 0U )
#define QEI_USER_QEI4CON_ON	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI4IOCレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI4IOC	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI4IOCレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI4IOC_QEA	( 0U )
#define QEI_USER_QEI4IOC_QEB	( 0U )
#define QEI_USER_QEI4IOC_INDEX	( 0U )
#define QEI_USER_QEI4IOC_HOME	( 0U )
#define QEI_USER_QEI4IOC_QEAPOL	( 0U )
#define QEI_USER_QEI4IOC_QEBPOL	( 0U )
#define QEI_USER_QEI4IOC_IDXPOL	( 0U )
#define QEI_USER_QEI4IOC_HOMPOL	( 0U )
#define QEI_USER_QEI4IOC_SWPAB	( 0U )
#define QEI_USER_QEI4IOC_OUTFNC	( 0U )
#define QEI_USER_QEI4IOC_QFDIV	( 0U )
#define QEI_USER_QEI4IOC_FLTREN	( 0U )
#define QEI_USER_QEI4IOC_QCAPEN	( 0U )
#define QEI_USER_QEI4IOC_HCAPEN	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI4STATレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI4STAT	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI4STATレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI4STAT_IDXIEN	( 0U )
#define QEI_USER_QEI4STAT_IDXIRQ	( 0U )
#define QEI_USER_QEI4STAT_HOMIEN	( 0U )
#define QEI_USER_QEI4STAT_HOMIRQ	( 0U )
#define QEI_USER_QEI4STAT_VELOVIEN	( 0U )
#define QEI_USER_QEI4STAT_VELOVIRQ	( 0U )
#define QEI_USER_QEI4STAT_PCIIEN	( 0U )
#define QEI_USER_QEI4STAT_PCIIRQ	( 0U )
#define QEI_USER_QEI4STAT_POSOVIEN	( 0U )
#define QEI_USER_QEI4STAT_POSOVIRQ	( 0U )
#define QEI_USER_QEI4STAT_PCLEQIEN	( 0U )
#define QEI_USER_QEI4STAT_PCLEQIRQ	( 0U )
#define QEI_USER_QEI4STAT_PCHEQIEN	( 0U )
#define QEI_USER_QEI4STAT_PCHEQIRQ	( 0U )
/*----------------------------------------------------------------------------*/
/* POS4CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_POS4CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* POS4HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_POS4HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* VEL4CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_VEL4CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* VEL4HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_VEL4HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* INT4TMRレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INT4TMR	( 0U )
/*----------------------------------------------------------------------------*/
/* INT4HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INT4HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* INDX4CNTレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INDX4CNT	( 0U )
/*----------------------------------------------------------------------------*/
/* INDX4HLDレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_INDX4HLD	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI4GECレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI4GEC	( 0U )
/*----------------------------------------------------------------------------*/
/* QEI4LECレジスタ */
/*----------------------------------------------------------------------------*/
#define QEI_USER_QEI4LEC	( 0U )

/*----------------------------------------------------------------------------*/
/*変数定義*/
/*----------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------*/
/*プロトタイプ宣言*/
/*----------------------------------------------------------------------------*/

#endif	/* QEI_USER_H */

